|Variable|Definition|Key|
|---|---|---|
|survival|Survival|0 = No, 1 = Yes|
|pclass|Ticket class|1 = 1st, 2 = 2nd, 3 = 3rd|
|gender|gender ||
|Age |Age in years| |
|sibsp |number of siblings / spouses aboard|	|
|parch |number of parents / children aboard| |
|ticket|Ticket number ||
|fare | fare| 	|
|cabin |Cabin number|	|
|embarked|Port of Embarkation|C = Cherbourg, Q = Queenstown, S = Southampton|
|boat | Lifeboat||
|body | Body Identification Number||
|home.dest| Home/destination||

- Read data and describe it
- Find columns with missingdata
- Print shape of dataset
- drop columns with more than 25% missing data
- drop columns having independent values(which do not affect the survival rate).


- check data types of all columns
- convert price to numeric
- find columns still having missing/na values and also count of missing data
- fill na with mean for fare and age column column.
- drop na values for embarked column.
- dump the dataframe to a csv file 'titanic_filtered.csv'.


- for surviced column replace 0 with D and 1 with A
- find the frequency of different values in survived column
- group by gender and survived and see the counts in each category
- find different pclass and no of people in each class

- find top 5 people with highest values of age. Count no of male and females in the top 5
- find max age male and female who survived
- get average age by gender
- get average age by people survived vs not-survived

In [6]:
import pandas as pd
import numpy as np

In [68]:
#Read data and describe it
df = pd.read_csv(r"\Users\AMIAMIT\Desktop\Assignment_LB\5th Assignment\titanic_dataset.csv")
print(df)
print(df.describe())

      Unnamed: 0  pclass  survived  \
0              0       1         1
1              1       1         1
2              2       1         0
3              3       1         0
4              4       1         0
...          ...     ...       ...
1304        1304       3         0
1305        1305       3         0
1306        1306       3         0
1307        1307       3         0
1308        1308       3         0

                                                 name  gender      age  sibsp  \
0                       Allen, Miss. Elisabeth Walton  female  29.0000      0
1                      Allison, Master. Hudson Trevor    male   0.9167      1
2                        Allison, Miss. Helen Loraine  female   2.0000      1
3                Allison, Mr. Hudson Joshua Creighton    male  30.0000      1
4     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  25.0000      1
...                                               ...     ...      ...    ...
1304                             Zabour, Miss. Hileni  female  14.5000      1
1305                            Zabour, Miss. Thamine  female      NaN      1
1306                        Zakarian, Mr. Mapriededer    male  26.5000      0
1307                              Zakarian, Mr. Ortin    male  27.0000      0
1308                               Zimmerman, Mr. Leo    male  29.0000      0

      parch  ticket      fare    cabin embarked boat   body  \
0         0   24160  $211.34        B5        S    2    NaN
1         2  113781  $151.55   C22 C26        S   11    NaN
2         2  113781  $151.55   C22 C26        S  NaN    NaN
3         2  113781  $151.55   C22 C26        S  NaN  135.0
4         2  113781  $151.55   C22 C26        S  NaN    NaN
...     ...     ...       ...      ...      ...  ...    ...
1304      0    2665   $14.45       NaN        C  NaN  328.0
1305      0    2665   $14.45       NaN        C  NaN    NaN
1306      0    2656    $7.23       NaN        C  NaN  304.0
1307      0    2670    $7.23       NaN        C  NaN    NaN
1308      0  315082    $7.88       NaN        S  NaN    NaN

                            home.dest
0                        St Louis, MO
1     Montreal, PQ / Chesterville, ON
2     Montreal, PQ / Chesterville, ON
3     Montreal, PQ / Chesterville, ON
4     Montreal, PQ / Chesterville, ON
...                               ...
1304                              NaN
1305                              NaN
1306                              NaN
1307                              NaN
1308                              NaN

[1309 rows x 15 columns]
        Unnamed: 0       pclass     survived          age        sibsp  \
count  1309.000000  1309.000000  1309.000000  1046.000000  1309.000000
mean    654.000000     2.294882     0.381971    29.881135     0.498854
std     378.020061     0.837836     0.486055    14.413500     1.041658
min       0.000000     1.000000     0.000000     0.166700     0.000000
25%     327.000000     2.000000     0.000000    21.000000     0.000000
50%     654.000000     3.000000     0.000000    28.000000     0.000000
75%     981.000000     3.000000     1.000000    39.000000     1.000000
max    1308.000000     3.000000     1.000000    80.000000     8.000000

             parch        body
count  1309.000000  121.000000
mean      0.385027  160.809917
std       0.865560   97.696922
min       0.000000    1.000000
25%       0.000000   72.000000
50%       0.000000  155.000000
75%       0.000000  256.000000
max       9.000000  328.000000

In [21]:
#Find columns with missingdata
print(df.columns[df.isna().any()])

Index(['age', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'], dtype='object')

In [22]:
#Print shape of dataset
print(df.shape)

(1309, 15)

In [23]:
#drop columns with more than 25% missing data
p = len(df)*.75
df.dropna(thresh = p, axis=1, inplace = True)
print(df.columns)

Index(['Unnamed: 0', 'pclass', 'survived', 'name', 'gender', 'age', 'sibsp',
       'parch', 'ticket', 'fare', 'embarked'],
      dtype='object')

In [26]:
#drop columns having independent values(which do not affect the survival rate).
df.drop(columns = ['Unnamed: 0', 'name'], inplace= True)
print(df.columns)

Index(['pclass', 'survived', 'gender', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')

In [28]:
#check data types of all columns
print(df.dtypes)

pclass         int64
survived       int64
gender        object
age          float64
sibsp          int64
parch          int64
ticket        object
fare          object
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

In [72]:
#convert price to numeric

In [67]:
#find columns still having missing/na values and also count of missing data
missing_cols = df.columns[df.isna().any()]
print(missing_cols)
print('\nCount of missing data')
print(df.isnull().sum().sort_values(ascending = False).head(len(missing_cols)))

Index(['age', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'], dtype='object')

Count of missing data
body         1188
cabin        1014
boat          823
home.dest     564
age           263
embarked        2
fare            1
dtype: int64

In [74]:
#fill na with mean for fare and age column column.
print(df['fare'].isna().sum())
mean_fare = df.fare.mean()
print(mean_fare)
df['fare'].fillna(mean_fare, inplace = True)
# for age
print(df['age'].isna().sum())
mean_age = df.age.mean()
print(mean_age)
df['age'].fillna(mean_age, inplace = True)

0
33.27158841562917
0
24.038063865487707

In [75]:
#drop na values for embarked column.
df.dropna(subset=['embarked'], inplace=True)
print(df)

      Unnamed: 0  pclass  survived  \
0              0       1         1
1              1       1         1
2              2       1         0
3              3       1         0
4              4       1         0
...          ...     ...       ...
1304        1304       3         0
1305        1305       3         0
1306        1306       3         0
1307        1307       3         0
1308        1308       3         0

                                                 name  gender        age  \
0                       Allen, Miss. Elisabeth Walton  female  29.000000
1                      Allison, Master. Hudson Trevor    male   0.916700
2                        Allison, Miss. Helen Loraine  female   2.000000
3                Allison, Mr. Hudson Joshua Creighton    male  30.000000
4     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  25.000000
...                                               ...     ...        ...
1304                             Zabour, Miss. Hileni  female  14.500000
1305                            Zabour, Miss. Thamine  female   0.799083
1306                        Zakarian, Mr. Mapriededer    male  26.500000
1307                              Zakarian, Mr. Ortin    male  27.000000
1308                               Zimmerman, Mr. Leo    male  29.000000

      sibsp  parch  ticket    fare    cabin embarked boat   body  \
0         0      0   24160  211.34       B5        S    2    NaN
1         1      2  113781  151.55  C22 C26        S   11    NaN
2         1      2  113781  151.55  C22 C26        S  NaN    NaN
3         1      2  113781  151.55  C22 C26        S  NaN  135.0
4         1      2  113781  151.55  C22 C26        S  NaN    NaN
...     ...    ...     ...     ...      ...      ...  ...    ...
1304      1      0    2665   14.45      NaN        C  NaN  328.0
1305      1      0    2665   14.45      NaN        C  NaN    NaN
1306      0      0    2656    7.23      NaN        C  NaN  304.0
1307      0      0    2670    7.23      NaN        C  NaN    NaN
1308      0      0  315082    7.88      NaN        S  NaN    NaN

                            home.dest
0                        St Louis, MO
1     Montreal, PQ / Chesterville, ON
2     Montreal, PQ / Chesterville, ON
3     Montreal, PQ / Chesterville, ON
4     Montreal, PQ / Chesterville, ON
...                               ...
1304                              NaN
1305                              NaN
1306                              NaN
1307                              NaN
1308                              NaN

[1307 rows x 15 columns]

In [77]:
#dump the dataframe to a csv file 'titanic_filtered.csv'.
df.to_csv('titanic_filtered_new.csv', index=False)
print('duming to new csv completed')

duming to new csv completed

In [78]:
# for surviced column replace 0 with D and 1 with A
mapping = {0: 'D', 1: 'A'}
df.replace({'survived': {0: 'D', 1: 'A'}}, inplace=True)
print(df)

      Unnamed: 0  pclass survived  \
0              0       1        A
1              1       1        A
2              2       1        D
3              3       1        D
4              4       1        D
...          ...     ...      ...
1304        1304       3        D
1305        1305       3        D
1306        1306       3        D
1307        1307       3        D
1308        1308       3        D

                                                 name  gender        age  \
0                       Allen, Miss. Elisabeth Walton  female  29.000000
1                      Allison, Master. Hudson Trevor    male   0.916700
2                        Allison, Miss. Helen Loraine  female   2.000000
3                Allison, Mr. Hudson Joshua Creighton    male  30.000000
4     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  25.000000
...                                               ...     ...        ...
1304                             Zabour, Miss. Hileni  female  14.500000
1305                            Zabour, Miss. Thamine  female   0.799083
1306                        Zakarian, Mr. Mapriededer    male  26.500000
1307                              Zakarian, Mr. Ortin    male  27.000000
1308                               Zimmerman, Mr. Leo    male  29.000000

      sibsp  parch  ticket    fare    cabin embarked boat   body  \
0         0      0   24160  211.34       B5        S    2    NaN
1         1      2  113781  151.55  C22 C26        S   11    NaN
2         1      2  113781  151.55  C22 C26        S  NaN    NaN
3         1      2  113781  151.55  C22 C26        S  NaN  135.0
4         1      2  113781  151.55  C22 C26        S  NaN    NaN
...     ...    ...     ...     ...      ...      ...  ...    ...
1304      1      0    2665   14.45      NaN        C  NaN  328.0
1305      1      0    2665   14.45      NaN        C  NaN    NaN
1306      0      0    2656    7.23      NaN        C  NaN  304.0
1307      0      0    2670    7.23      NaN        C  NaN    NaN
1308      0      0  315082    7.88      NaN        S  NaN    NaN

                            home.dest
0                        St Louis, MO
1     Montreal, PQ / Chesterville, ON
2     Montreal, PQ / Chesterville, ON
3     Montreal, PQ / Chesterville, ON
4     Montreal, PQ / Chesterville, ON
...                               ...
1304                              NaN
1305                              NaN
1306                              NaN
1307                              NaN
1308                              NaN

[1307 rows x 15 columns]

In [79]:
#find the frequency of different values in survived column
print(df.survived.value_counts())

D    809
A    498
Name: survived, dtype: int64

In [80]:
# group by gender and survived and see the counts in each category

grp = df.groupby(by=["gender","age"])
print(grp.size().reset_index(name='counts'))

     gender        age  counts
0    female   0.166700       1
1    female   0.750000       2
2    female   0.799083      78
3    female   0.916700       1
4    female   1.000000       5
..      ...        ...     ...
162    male  70.000000       2
163    male  70.500000       1
164    male  71.000000       2
165    male  74.000000       1
166    male  80.000000       1

[167 rows x 3 columns]

In [81]:
#find different pclass and no of people in each class
d = df['pclass'].value_counts()
print(d)

3    709
1    321
2    277
Name: pclass, dtype: int64

In [85]:
#find top 5 people with highest values of age. Count no of male and females in the top 5
print(df.sort_values(by=['age'], ascending=False).head())
print(df.sort_values(by=['age'], ascending=False).head().groupby(by=['gender']).size().reset_index(name='counts'))

      Unnamed: 0  pclass survived  \
14            14       1        A
61            61       1        A
1235        1235       3        D
135          135       1        D
9              9       1        D

                                                   name  gender   age  sibsp  \
14                 Barkworth, Mr. Algernon Henry Wilson    male  80.0      0
61    Cavendish, Mrs. Tyrell William (Julia Florence...  female  76.0      1
1235                                Svensson, Mr. Johan    male  74.0      0
135                           Goldschmidt, Mr. George B    male  71.0      0
9                               Artagaveytia, Mr. Ramon    male  71.0      0

      parch    ticket   fare cabin embarked boat  body  \
14        0     27042  30.00   A23        S    B   NaN
61        0     19877  78.85   C46        S    6   NaN
1235      0    347060   7.78   NaN        S  NaN   NaN
135       0  PC 17754  34.65    A5        C  NaN   NaN
9         0  PC 17609  49.50   NaN        C  NaN  22.0

                    home.dest
14              Hessle, Yorks
61    Little Onn Hall, Staffs
1235                      NaN
135              New York, NY
9         Montevideo, Uruguay
   gender  counts
0  female       1
1    male       4

In [84]:
#find max age male and female who survived
print(df[df.survived == 'A'].groupby(by=['gender']).age.max())

gender
female    76.0
male      80.0
Name: age, dtype: float64

In [86]:
#get average age by gender
print(df.groupby(by=['gender']).age.mean())

gender
female    23.907138
male      24.048533
Name: age, dtype: float64

In [87]:
# get average age by people survived vs not-survived

print(df.groupby(by=['survived']).age.mean())

survived
A    24.71168
D    23.55922
Name: age, dtype: float64